test/wrk2_wsk/social_network/results/output_compose-post-sync_2.log
Running 10m test @ http://130.127.133.207:32001
  1 threads and 2 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.77m     2.54m   10.00m    60.47%
    Req/Sec     0.23      4.87   111.00     99.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.04m 
 75.000%    7.84m 
 90.000%    9.20m 
 99.000%    9.96m 
 99.900%   10.01m 
 99.990%   10.01m 
 99.999%   10.01m 
100.000%   10.01m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   46366.719     0.000000            1         1.00
  136314.879     0.100000           13         1.11
  185073.663     0.200000           26         1.25
  240254.975     0.300000           39         1.43
  312213.503     0.400000           52         1.67
  362545.151     0.500000           65         2.00
  380370.943     0.550000           71         2.22
  402915.327     0.600000           78         2.50
  428343.295     0.650000           84         2.86
  449576.959     0.700000           91         3.33
  470286.335     0.750000           97         4.00
  475529.215     0.775000          100         4.44
  489684.991     0.800000          104         5.00
  504102.911     0.825000          107         5.71
  520355.839     0.850000          110         6.67
  540540.927     0.875000          113         8.00
  548929.535     0.887500          115         8.89
  554696.703     0.900000          117        10.00
  557842.431     0.912500          118        11.43
  564658.175     0.925000          120        13.33
  571473.919     0.937500          121        16.00
  571998.207     0.943750          122        17.78
  576192.511     0.950000          123        20.00
  583008.255     0.956250          124        22.86
  586678.271     0.962500          125        26.67
  586678.271     0.968750          125        32.00
  589823.999     0.971875          126        35.56
  589823.999     0.975000          126        40.00
  593494.015     0.978125          127        45.71
  593494.015     0.981250          127        53.33
  593494.015     0.984375          127        64.00
  597688.319     0.985938          128        71.11
  597688.319     0.987500          128        80.00
  597688.319     0.989062          128        91.43
  597688.319     0.990625          128       106.67
  597688.319     0.992188          128       128.00
  600309.759     0.992969          129       142.22
  600309.759     1.000000          129          inf
#[Mean    =   346172.583, StdDeviation   =   152374.751]
#[Max     =   599785.472, Total count    =          129]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    6.90s 
 75.000%   11.71s 
 90.000%   17.53s 
 99.000%   46.37s 
 99.900%   48.92s 
 99.990%   48.92s 
 99.999%   48.92s 
100.000%   48.92s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     286.719     0.000000            1         1.00
    3084.287     0.100000           13         1.11
    4071.423     0.200000           26         1.25
    5038.079     0.300000           39         1.43
    5693.439     0.400000           52         1.67
    6901.759     0.500000           65         2.00
    7585.791     0.550000           71         2.22
    8286.207     0.600000           78         2.50
    8986.623     0.650000           84         2.86
   10854.399     0.700000           91         3.33
   11714.559     0.750000           97         4.00
   12673.023     0.775000          100         4.44
   13737.983     0.800000          104         5.00
   15474.687     0.825000          107         5.71
   16080.895     0.850000          110         6.67
   16793.599     0.875000          113         8.00
   16973.823     0.887500          115         8.89
   18022.399     0.900000          117        10.00
   18989.055     0.912500          118        11.43
   21037.055     0.925000          120        13.33
   21725.183     0.937500          121        16.00
   21741.567     0.943750          122        17.78
   22216.703     0.950000          123        20.00
   22691.839     0.956250          124        22.86
   25509.887     0.962500          125        26.67
   25509.887     0.968750          125        32.00
   26656.767     0.971875          126        35.56
   26656.767     0.975000          126        40.00
   27557.887     0.978125          127        45.71
   27557.887     0.981250          127        53.33
   27557.887     0.984375          127        64.00
   46366.719     0.985938          128        71.11
   46366.719     0.987500          128        80.00
   46366.719     0.989062          128        91.43
   46366.719     0.990625          128       106.67
   46366.719     0.992188          128       128.00
   48922.623     0.992969          129       142.22
   48922.623     1.000000          129          inf
#[Mean    =     9279.874, StdDeviation   =     7602.299]
#[Max     =    48889.856, Total count    =          129]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  129 requests in 10.00m, 60.34KB read
  Socket errors: connect 0, read 0, write 0, timeout 476
Requests/sec:      0.21
Transfer/sec:     102.98B