test/wrk2_wsk/social_network/results/output_social-graph-follow-with-username-merged.log
Running 10m test @ http://130.127.133.207:32001
  1 threads and 1 connections
  Thread calibration: mean lat.: 7297.024ms, rate sampling interval: 15106ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.17m     2.66m    9.77m    57.78%
    Req/Sec    22.08      4.02    25.00     89.74%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.13m 
 75.000%    7.49m 
 90.000%    8.86m 
 99.000%    9.69m 
 99.900%    9.78m 
 99.990%    9.78m 
 99.999%    9.78m 
100.000%    9.78m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   13287.423     0.000000            1         1.00
   92405.759     0.100000         1334         1.11
  146538.495     0.200000         2668         1.25
  200409.087     0.300000         4001         1.43
  253886.463     0.400000         5335         1.67
  308019.199     0.500000         6670         2.00
  334757.887     0.550000         7336         2.22
  366215.167     0.600000         8002         2.50
  393478.143     0.650000         8667         2.86
  421789.695     0.700000         9333         3.33
  449314.815     0.750000         9997         4.00
  463994.879     0.775000        10330         4.44
  477888.511     0.800000        10665         5.00
  491257.855     0.825000        11001         5.71
  504102.911     0.850000        11331         6.67
  518258.687     0.875000        11665         8.00
  524812.287     0.887500        11830         8.89
  531890.175     0.900000        11997        10.00
  538443.775     0.912500        12165        11.43
  545783.807     0.925000        12341        13.33
  552599.551     0.937500        12498        16.00
  556269.567     0.943750        12591        17.78
  559939.583     0.950000        12677        20.00
  562561.023     0.956250        12746        22.86
  566231.039     0.962500        12842        26.67
  569376.767     0.968750        12922        32.00
  570949.631     0.971875        12966        35.56
  573046.783     0.975000        13002        40.00
  574619.647     0.978125        13046        45.71
  576192.511     0.981250        13088        53.33
  578289.663     0.984375        13128        64.00
  579338.239     0.985938        13146        71.11
  580386.815     0.987500        13177        80.00
  580911.103     0.989062        13191        91.43
  581435.391     0.990625        13205       106.67
  582483.967     0.992188        13225       128.00
  583532.543     0.992969        13241       142.22
  584056.831     0.993750        13256       160.00
  584581.119     0.994531        13270       182.86
  584581.119     0.995313        13270       213.33
  585105.407     0.996094        13286       256.00
  585105.407     0.996484        13286       284.44
  585629.695     0.996875        13301       320.00
  585629.695     0.997266        13301       365.71
  585629.695     0.997656        13301       426.67
  586153.983     0.998047        13315       512.00
  586153.983     0.998242        13315       568.89
  586153.983     0.998437        13315       640.00
  586153.983     0.998633        13315       731.43
  586153.983     0.998828        13315       853.33
  586678.271     0.999023        13329      1024.00
  586678.271     1.000000        13329          inf
#[Mean    =   310322.898, StdDeviation   =   159637.313]
#[Max     =   586153.984, Total count    =        13329]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   36.45ms
 75.000%   38.72ms
 90.000%   45.31ms
 99.000%  155.65ms
 99.900%  544.26ms
 99.990%    5.07s 
 99.999%    5.67s 
100.000%    5.67s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      24.223     0.000000            1         1.00
      29.135     0.100000         1346         1.11
      31.599     0.200000         2667         1.25
      34.175     0.300000         3999         1.43
      35.455     0.400000         5343         1.67
      36.447     0.500000         6713         2.00
      36.895     0.550000         7374         2.22
      37.311     0.600000         8032         2.50
      37.727     0.650000         8679         2.86
      38.207     0.700000         9366         3.33
      38.719     0.750000        10005         4.00
      39.039     0.775000        10340         4.44
      39.423     0.800000        10665         5.00
      39.967     0.825000        11007         5.71
      40.895     0.850000        11334         6.67
      42.719     0.875000        11667         8.00
      43.967     0.887500        11831         8.89
      45.311     0.900000        11998        10.00
      47.551     0.912500        12166        11.43
      51.263     0.925000        12331        13.33
      57.823     0.937500        12496        16.00
      59.967     0.943750        12581        17.78
      62.623     0.950000        12663        20.00
      65.151     0.956250        12746        22.86
      70.271     0.962500        12830        26.67
      89.599     0.968750        12913        32.00
      93.247     0.971875        12956        35.56
      94.719     0.975000        12997        40.00
      98.047     0.978125        13039        45.71
      99.839     0.981250        13081        53.33
     103.679     0.984375        13122        64.00
     109.183     0.985938        13142        71.11
     118.463     0.987500        13163        80.00
     133.503     0.989062        13184        91.43
     162.047     0.990625        13206       106.67
     205.695     0.992188        13225       128.00
     246.271     0.992969        13236       142.22
     269.055     0.993750        13246       160.00
     317.951     0.994531        13257       182.86
     380.159     0.995313        13267       213.33
     420.351     0.996094        13277       256.00
     433.919     0.996484        13283       284.44
     442.111     0.996875        13288       320.00
     456.703     0.997266        13293       365.71
     476.671     0.997656        13298       426.67
     492.799     0.998047        13303       512.00
     511.999     0.998242        13306       568.89
     530.943     0.998437        13309       640.00
     534.527     0.998633        13311       731.43
     541.695     0.998828        13314       853.33
     544.255     0.999023        13316      1024.00
     555.519     0.999121        13318      1137.78
     557.055     0.999219        13319      1280.00
     560.127     0.999316        13320      1462.86
     594.943     0.999414        13322      1706.67
     606.207     0.999512        13323      2048.00
    2490.367     0.999561        13324      2275.56
    2490.367     0.999609        13324      2560.00
    3682.303     0.999658        13325      2925.71
    4464.639     0.999707        13326      3413.33
    4464.639     0.999756        13326      4096.00
    4567.039     0.999780        13327      4551.11
    4567.039     0.999805        13327      5120.00
    4567.039     0.999829        13327      5851.43
    5074.943     0.999854        13328      6826.67
    5074.943     0.999878        13328      8192.00
    5074.943     0.999890        13328      9102.22
    5074.943     0.999902        13328     10240.00
    5074.943     0.999915        13328     11702.86
    5672.959     0.999927        13329     13653.33
    5672.959     1.000000        13329          inf
#[Mean    =       43.012, StdDeviation   =       99.569]
#[Max     =     5668.864, Total count    =        13329]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  13340 requests in 10.00m, 6.09MB read
  Socket errors: connect 0, read 0, write 0, timeout 10
Requests/sec:     22.23
Transfer/sec:     10.40KB